; domain
(define (domain satellite)
  (:requirements :strips :equality :typing)
  (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:action turn-to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
           )
  )

 
  (:action switch-on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch-off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )


  (:action take-image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
               )
   :effect (have_image ?d ?m)
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image4 - mode
	thermograph1 - mode
	thermograph0 - mode
	thermograph2 - mode
	image3 - mode
	GroundStation2 - direction
	Star1 - direction
	Star4 - direction
	Star0 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Planet20 - direction
	Star21 - direction
	Star22 - direction
	Planet23 - direction
	Planet24 - direction
	Planet25 - direction
	Star26 - direction
	Phenomenon27 - direction
	Planet28 - direction
	Planet29 - direction
)
(:init
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph1)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star19)
	(supports instrument2 thermograph0)
	(supports instrument2 image4)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet17)
	(supports instrument3 image4)
	(supports instrument3 image3)
	(calibration_target instrument3 Star1)
	(supports instrument4 image3)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
	(supports instrument5 thermograph1)
	(supports instrument5 image4)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument6 image3)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star4)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star0)
	(supports instrument8 image3)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon5)
)
(:goal (and
	(pointing satellite1 Phenomenon5)
	(pointing satellite2 Planet11)
	(pointing satellite4 Planet11)
	(have_image Phenomenon5 thermograph1)
	(have_image Planet6 image4)
	(have_image Planet7 image3)
	(have_image Planet8 image3)
	(have_image Planet9 thermograph0)
	(have_image Planet10 thermograph1)
	(have_image Planet11 thermograph2)
	(have_image Phenomenon12 image3)
	(have_image Planet13 thermograph1)
	(have_image Star14 image3)
	(have_image Planet15 thermograph0)
	(have_image Planet16 image3)
	(have_image Planet17 image4)
	(have_image Phenomenon18 image3)
	(have_image Star19 thermograph0)
	(have_image Star21 thermograph1)
	(have_image Star22 image4)
	(have_image Planet23 thermograph1)
	(have_image Planet24 thermograph2)
	(have_image Planet25 thermograph1)
	(have_image Star26 thermograph0)
	(have_image Phenomenon27 thermograph1)
	(have_image Planet28 thermograph2)
	(have_image Planet29 thermograph0)
))

(:metric minimize (total-time))
)

; plan
1. (turn-to satellite2 planet11 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet11)
   goals met: 1 of 27
2. (turn-to satellite4 star4 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 star4)
   goals met: 1 of 27
3. (switch-on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 1 of 27
4. (calibrate satellite4 instrument6 star4)
   added: (calibrated instrument6)
   goals met: 1 of 27
5. (turn-to satellite4 star21 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star21)
   goals met: 1 of 27
6. (take-image satellite4 star21 instrument6 thermograph1)
   added: (have_image star21 thermograph1)
   goals met: 2 of 27
7. (switch-on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 27
8. (turn-to satellite1 groundstation3 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 groundstation3)
   goals met: 2 of 27
9. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 2 of 27
10. (turn-to satellite1 planet11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet11)
   goals met: 2 of 27
11. (take-image satellite1 planet11 instrument2 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 3 of 27
12. (turn-to satellite4 planet13 star21)
   deleted: (pointing satellite4 star21)
   added: (pointing satellite4 planet13)
   goals met: 3 of 27
13. (take-image satellite4 planet13 instrument6 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 4 of 27
14. (turn-to satellite1 star22 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star22)
   goals met: 4 of 27
15. (turn-to satellite4 phenomenon18 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 phenomenon18)
   goals met: 4 of 27
16. (take-image satellite1 star22 instrument2 image4)
   added: (have_image star22 image4)
   goals met: 5 of 27
17. (take-image satellite4 phenomenon18 instrument6 image3)
   added: (have_image phenomenon18 image3)
   goals met: 6 of 27
18. (turn-to satellite1 planet17 star22)
   deleted: (pointing satellite1 star22)
   added: (pointing satellite1 planet17)
   goals met: 6 of 27
19. (turn-to satellite4 planet8 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 planet8)
   goals met: 6 of 27
20. (take-image satellite1 planet17 instrument2 image4)
   added: (have_image planet17 image4)
   goals met: 7 of 27
21. (take-image satellite4 planet8 instrument6 image3)
   added: (have_image planet8 image3)
   goals met: 8 of 27
22. (turn-to satellite1 planet6 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet6)
   goals met: 8 of 27
23. (take-image satellite1 planet6 instrument2 image4)
   added: (have_image planet6 image4)
   goals met: 9 of 27
24. (turn-to satellite4 planet25 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 planet25)
   goals met: 9 of 27
25. (take-image satellite4 planet25 instrument6 thermograph1)
   added: (have_image planet25 thermograph1)
   goals met: 10 of 27
26. (turn-to satellite4 planet7 planet25)
   deleted: (pointing satellite4 planet25)
   added: (pointing satellite4 planet7)
   goals met: 10 of 27
27. (take-image satellite4 planet7 instrument6 image3)
   added: (have_image planet7 image3)
   goals met: 11 of 27
28. (turn-to satellite4 planet9 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 planet9)
   goals met: 11 of 27
29. (take-image satellite4 planet9 instrument6 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 12 of 27
30. (turn-to satellite4 star4 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star4)
   goals met: 12 of 27
31. (turn-to satellite4 planet10 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 planet10)
   goals met: 12 of 27
32. (take-image satellite4 planet10 instrument6 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 13 of 27
33. (turn-to satellite4 star14 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 star14)
   goals met: 13 of 27
34. (take-image satellite4 star14 instrument6 image3)
   added: (have_image star14 image3)
   goals met: 14 of 27
35. (turn-to satellite4 star26 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star26)
   goals met: 14 of 27
36. (take-image satellite4 star26 instrument6 thermograph0)
   added: (have_image star26 thermograph0)
   goals met: 15 of 27
37. (turn-to satellite4 planet29 star26)
   deleted: (pointing satellite4 star26)
   added: (pointing satellite4 planet29)
   goals met: 15 of 27
38. (take-image satellite4 planet29 instrument6 thermograph0)
   added: (have_image planet29 thermograph0)
   goals met: 16 of 27
39. (turn-to satellite4 phenomenon5 planet29)
   deleted: (pointing satellite4 planet29)
   added: (pointing satellite4 phenomenon5)
   goals met: 16 of 27
40. (take-image satellite4 phenomenon5 instrument6 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 17 of 27
41. (turn-to satellite4 phenomenon12 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 phenomenon12)
   goals met: 17 of 27
42. (take-image satellite4 phenomenon12 instrument6 image3)
   added: (have_image phenomenon12 image3)
   goals met: 18 of 27
43. (turn-to satellite4 planet16 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 planet16)
   goals met: 18 of 27
44. (take-image satellite4 planet16 instrument6 image3)
   added: (have_image planet16 image3)
   goals met: 19 of 27
45. (turn-to satellite1 star19 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star19)
   goals met: 19 of 27
46. (take-image satellite1 star19 instrument2 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 20 of 27
47. (turn-to satellite4 phenomenon27 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 phenomenon27)
   goals met: 20 of 27
48. (take-image satellite4 phenomenon27 instrument6 thermograph1)
   added: (have_image phenomenon27 thermograph1)
   goals met: 21 of 27
49. (turn-to satellite4 planet23 phenomenon27)
   deleted: (pointing satellite4 phenomenon27)
   added: (pointing satellite4 planet23)
   goals met: 21 of 27
50. (take-image satellite4 planet23 instrument6 thermograph1)
   added: (have_image planet23 thermograph1)
   goals met: 22 of 27
51. (turn-to satellite4 planet11 planet23)
   deleted: (pointing satellite4 planet23)
   added: (pointing satellite4 planet11)
   goals met: 23 of 27
52. (turn-to satellite1 planet24 star19)
   deleted: (pointing satellite1 star19)
   added: (pointing satellite1 planet24)
   goals met: 23 of 27
53. (take-image satellite1 planet24 instrument2 thermograph2)
   added: (have_image planet24 thermograph2)
   goals met: 24 of 27
54. (turn-to satellite1 planet28 planet24)
   deleted: (pointing satellite1 planet24)
   added: (pointing satellite1 planet28)
   goals met: 24 of 27
55. (take-image satellite1 planet28 instrument2 thermograph2)
   added: (have_image planet28 thermograph2)
   goals met: 25 of 27
56. (turn-to satellite1 planet15 planet28)
   deleted: (pointing satellite1 planet28)
   added: (pointing satellite1 planet15)
   goals met: 25 of 27
57. (take-image satellite1 planet15 instrument2 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 26 of 27
58. (turn-to satellite1 phenomenon5 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon5)
   goals met: 27 of 27
